{
    "header_options": {
        "home": "Home",
        "projects": "Projetos",
        "contact": "Contato",
        "button_design_option": "Design",
        "button_code_option": "Dev"
    },
    "all_projects": "Todos os Projetos",
    "cases": "Casos Reais",
    "project": "Projetos",
    "andWorks": "e Trabalhos",
    "welcome_to_React": "Bem vindo ao react-i18next",
    "title_banner": "Pedro Lopes",
    "overview_text_banner": "Olá, sou pedro Lopes, designer e programador, fique a vontade para conhecer mais sobre mim e mus trabalhos.",
    "first_section_title":"Quem sou eu?",
    "first_modal_title":"Trajetória pessoal",
    "first_terminal_path_source":"pessoal",
    "first_terminal_description_0":" Comecei na tecnologia através da área de testes de softwares como QA realizando testes em produtos financeiros, em seguida, comecei com implementação e manutenção de códigos frontend, nessa área de atuação aprendi alguns frameworks javascript como vue.js, react, react-native e angular.",
    "first_terminal_description_1":"Em paralelo estudando ferramentas ágeis para aprimorar nos processos e gerenciamento do tempo, em seguida estudei linguagens e frameworks backend como o node js, express, nest js e loopback 4, por fim, junto a este conhecimentos em API's fiz a criação de alguns esquemas e funcionalidades em banco de dados NOSQL e MYSQL.",
    
    "second_modal_title":"Experiência profissional",
    "second_terminal_path_source":"profissional",
    "second_terminal_description_0":" Atualmente atuo como desenvolvedor FullStack, estou cursando graduação em engenharia de software na UDESC (Universidade estadual de Santa Catarina) e possuo 3 anos de experiência em desenvolvimento frontend e 2 ano e meio de conhecimento em backend, realizei projetos pessoais utilizando frameworks javascripts buscando sempre uma melhor qualificação.",
    "second_terminal_description_1":"Obtive certificação em design gráfico, me ajudando a desenvolver minhas soft skills e a ter um conhecimento diversificado, isto tem me favorecido com relação ao visual e experiência do usuário. Atualmente sigo estudando mais ferramentas de design e ênfase com a experiÊncia do usuário.",

    "skills_modal_title":"Software Skills",

    "button_work_text_0":"Trabalhos Design",
    "button_work_text_1":"Trabalhos Web",
    "button_work_text_2":"Trabalhos Backend",

    "ux_project_description_0":"O UX/UI desse projeto foi feito a partir de uma atividade da aula de processos de software da faculdade, propõe um app para ajudar animais que estão em situações de rua ou mesmo que correm algum perigo ...",
    "ux_project_description_1":"Match Coder é um projeto de UX/UI feito de uma atividade da aula de processos de software da faculdade, a ideia desse software é fazer um sistema de relacionamento entre empresa e canditado da área de software ...",
    "ux_project_description_2":"Esse projeto UX/UI foi criado a partir de uma lista de re4quisitos proposta pelo professor de Projetos de interface da faculdade, tem a ideia de avisar a população de desastres naturais que poderm estar acontecendo ...",
    "ux_project_description_3":"Educa Cred é um projeto de UX/UI feito de um desafio proposto pelo SERASA para propor uma solução financeira para a população, baseado em alguns requisitos porpóstos pelo coordenador da vaga ...",
    
    "web_project_description_0":"Link Leito é um aplicativo que consiste em uma gama de utilidades para atender a pacientes de um hospital de maneira mais eficiente e rápida permitindo todos os profissionais visualizem e interagam com o processo do paciente...",
    "web_project_description_1":"The chat app é um aplicativo de mensagens por chat, esse projeto foi desenvolvido com tecnologia web como vue js, node js, e socket io para uma comunicação em tempo real e um banco de dados em mongo DB...",
    "web_project_description_2":"Quizz Game é um aplicativo idealizado através de uma atividade da matéria de introdução a engenharia de software, o aplicativo propõe um jogo com matérias voltadas para vestibulares do brasil, desenvolvido com tecnologias web mais atuais...",
    "web_project_description_3":"Pet System é um sistema que foi desenvolvido para gestão de um pet shop, esse sistema foi criado com HTML, CSS e javascript puro sem a utlização de nenhum Framework... ",
    "web_project_description_4":"AdmitOne é um projeto a partir de um desafio para uma vaga como desenvolvedor frontend, o desafio propõe recriar a página do site da empresa https://admitone.com/ ...",

    "backend_project_description_0":"Esse projeto foi desenvolvido com node js, mongo DB utilizando express como um facilitador para a construção da aplicação, neste projeto existe também a implementação de testes unitários...",
    "backend_project_description_1":"Essa API foi desenvolvida com node js, express, cloudinary para uploads, mongo DB como banco de dados e socket io para comunicação em tempo real, neste projeto existe também a implementação de testes unitários... ",
    "backend_project_description_2":"Essa API foi desenvolvida com node js, express, cloudinary para uploads e nodemailer para envio de emails, neste projeto existe também a implementação de testes unitários...",
    "backend_project_description_3":"Essa API foi desenvolvida com java com spring boot, neste projeto consiste em recriar as funcionalidades do link leito para controle de um hospital...",

    "button_work_show_more":"Ver mais",

    "footer_section_title":"Entre em contato",

    "footer_button_home":"Voltar ao inicio",
    
    "modal_option_text":"Antes de entrar neste site, quero que você tenha a melhor experiência possivel, então me conta...",
    "button_design_option":"Só estou de olho",
    "button_code_option":"Sou da TI",

    "about_me_title": "Sobre",
    
    "about_me_subtitle_1": "O começo",
    "about_me_text_1": "Meu inicio na tecnologia foi através do trabalho em qualidade de softwares fazendo testes em produtos financeiros, após implementar manutenção no frontend desses produtos, neste momento aprendo alguns frameworks javascript como vue.js, react, react-native e angular.",

    "about_me_subtitle_2": "Contato",
    "about_me_text_2": "Você pode entrar em contato comigo por e-mail ou rede social, eu costumo responder em 3 dias",
    
    "button_about_me_hire": "CONTRATE-ME",
    "button_about_me_know_more": "SAIBA MAIS",

    "pretitle_services": "O QUE EU FAREI POR VOCÊ",
    "title_services": "Serviços",

    "services_ux_ui": "UX/UI",
    "services_ux_ui_text": "Crio planos de projeto, wireframes, testes de conceito, guia de estilo, responsividade, interface de teste do usuário.",

    "services_web_dev": "Desenvolvimento Web",
    "services_web_dev_text": "Crio sites e aplicativos com base em projetos ux/ui, responsividade, multiplataforma e funcionalidades de usabilidade.",

    "services_software_engineer": "Engenheiro de software",
    "services_software_engineer_text": "Crio aplicações como API's e severs, implantação CI/CD, DevOps e solução de tecnologia.",

    "comment_01": "Sempre ajudando colegas com dúvidas e disposto a ajudar sua equipe em qualquer situação.",
    "comment_02": "Pedro é um excelente profissional e muito facil de se trabalhar, muitas ideias geniais e pertinentes.",
    "comment_03": "Sempre buscando a melhora em seus projetos e estudando novos métodos e tecnologias constantemente para facilitar suas aplicações.",
    "comment_04": "Recomendo o Pedro para qualquer tipo de serviço na área de tecnologia, um excelente profissional.",


    "projects": {
        "electrolux" : {
            "title": "Engenharia de Software na Electrolux",
            "fisrtDescription": "A Electrolux contém uma história de 100 anos e durante esse tempo vem acumulando vitórias e conquistas, está presente no brasil desde 1926 e vende milhares de produtos por ano, uma das únicas marcas mundiais que […]",

            "projectDate": "20/12/2021",

            "problemTitle": "Electrolux",
            "problemDescription": "A Electrolux contém uma história de 100 anos e durante esse tempo vem acumulando vitórias e conquistas, está presente no brasil desde 1926 e vende milhares de produtos por ano, uma das únicas marcas mundiais que oferece produtos de qualidade e soluções completas para clientes e profissionais. <br> <br> Com um coleção de produtos inovadores e cuidadosamente desenvolvidos, a Electrolux tem grande destaque no mercado brasileiro de eletroportáteis, devido a esse histórico de sucesso, a Electrolux Brasil está presente nas casas e na memória de muitos brasileiros e conta com um time sensacional de profissionais seniores para continuar este legado de excelência para o cliente, promovendo uma experiência Electrolux a todos que consomem seus produtos. <br> <br>",

            "solutionTitle": "Desafio",
            "solutionDescription": "Um dos maiores relatos que trago como engenheiro de software do time que atende electrolux foi a migração de uma antiga tecnoliga vtex (CMS) para uma loja online totalmente mais sofisticada e intuitiva com a tecnologia Headless VTEX IO, está migração aconteceu gradativamente, durante todo o processo de transição, houve a caltela e analise das conversões, por exemplo, migrar somente uma ou duas páginas para o VTEX IO e observando a adesão do publico quanto a está nova stack.",

            "ExampleTitle": "A solução",
            "ExampleDescription": "Por fim, chegamos ao final do processo de migração e tudo correu bem, o novo rosto e corpo da electrolux brasil estava implementado e funcionando para todos os clientes, o objetivo final de ter uma conversão de vendas maior foi alcançado, devido a nova tecnologia a loja online da electrolux se mostrou mais perfomatica e com uma experiência diferenciada de todos no mercado de eletroportateis.",
            "ExampleImageAlt": "Project Print",

            "finalTitle": "Electrolux Atualmente",
            "finalDescription": "A Electrolux continua seguindo constantes melhorias em todos os setores de sua Loja, atualmente atuo como engenheiro de software do squad de Web Expirience (Experiência do usuário) atuando em melhorias e constantes ajustes que fazem com que o usuário tenha uma experiência profissional e de conforto para casa do cliente mesmo que esteja visitando a loja e navegando pelos produtos.",
            
            "banner_description": "Entenda como foi o desafio da migração de uma das lojas que mais vendem eletroportáteis do Brasil"
        },

        "link_leito" : {
            "title": "Projeto Link Leito",
            "fisrtDescription": "O projeto link leito foi criado em 2021 quando a pandemia do COVID-19 se espalhou por todo mundo enquanto eu estava estudando no Senai de Florianópolis SC surgiu [...]",

            "projectDate": "01/02/2020",

            "problemTitle": "Link Leito app",
            "problemDescription": "No começo do projeto contamos com a colaboração de todos os funcionários que atuavam na emergência do hospital desde a entrada do paciente até a sua alta do hospital, em constantes validações com equipe que usaria o software que estávamos propondo a criar <br><br> Durante o ano de 2021, com a pandemia já instalada em todo país houveram diversos momentos difíceis de realizar uma comunicação presencial com a equipe devido às medidas de distanciamento social, porém mesmo com as dificuldades realizamos as validações e sempre com objetivo de diminuir o tempo de espera do atendimento de pacientes, E podendo observar pontos do processo de internação do paciente e analisar onde havia erros e demoras excessivas",

            "solutionTitle": "Desafios de implementação",
            "solutionDescription": "Mesmo entendendo todo o processo do hospital ainda assim um dos maiores desafios foi fazer com que aquela tecnologia tivesse adesão dentro do hospital por parte dos funcionários, ao longo da implementação e validações conseguimos observar melhorias constantes fazendo com que o projeto cresce exponencialmente.",

            "ExampleTitle": "A Solução Link-Leito",
            "ExampleDescription": "O link leito propôs a solução definitiva para filas em hospitais no momento que havia superlotação de UTIs, partir da análise do atendimento de diversos pacientes através da captação dos dados durante o processo como, a quantidade de tempo que um paciente demora para ser atendido ou que demora para um leito estar limpo e voltar a estar disponível, através dessas métricas de tempo, construímos um painel administrativo e área de relatórios para que o gestor do hospital observasse todos os dados e conseguisse melhor adaptar a equipe de profissionais.",
            "ExampleImageAlt": "link leito Project Print",

            "finalTitle": "Link leito atualmente",
            "finalDescription": "Link leito atualmente se encontra desativado temporariamente pois a equipe do hospital decidiu seguir por outro caminho e a dificuldade de adesão ao software contribuiu para que o projeto fosse engavetado porém nunca será esquecido pois a diversos relatos do Lito Lito na mídia <br><br> E para que este projeto de alguma forma possa seguir em frente, muitos trabalhos e projetos da Universidade que estou cursando no momento possuem algum estudo de caso ou explanação sobre o link leito",

            "banner_description": "Conheça um pouco do projeto Link Leito e a solução tecnólogica aplicada a realidade."
        },

        "triper" : {
            "title": "Triper: Site de viagens",
            "fisrtDescription": "Triper é um website que criei recentemente com o objetivo de melhorar meus conhecimentos em Next.js, animações CSS e habilidades de código limpo. O site foi construído usando o framework Next.js […]",

            "projectDate": "20/12/2021",

            "problemTitle": "Caso de Estudo",
            "problemDescription": "Triper é um website que criei recentemente com o objetivo de melhorar meus conhecimentos em Next.js, animações CSS e habilidades de código limpo. O site foi construído usando o framework Next.js, que é uma ferramenta poderosa para criar front-end React com renderização do lado do servidor e geração de sites estáticos para aplicativos da web baseados em React. Foi muito interessante aprender essa ferramenta para entender como melhorar a performance de sites e melhorar a experiência do usuário em sua navegação. Durante o desenvolvimento fui também compreendendo diferentes opções de animações CSS para que o site ficasse mais fluido e sua navegação mais suavizada, animações de elementos da página e keyframes para criar movimentos personalizados.",

            "solutionTitle": "Soluções e aplicações",
            "solutionDescription": "Diante dos desafios da implementação, eu pude seguir as melhores práticas e padrões de organização de código e documentação para entender este cenário aplicado a um projeto em seguida comparar com aplicações do mercado atual. Em seguida pude compreender as diferentes lógicas que poderia aplicar nas animações da página e em quais momentos as animações aconteceriam, este processo exigiu implementar uma mistura do Next com o CSS e o resultado foi sensacional",

            "ExampleTitle": "O Projeto",
            "ExampleDescription": "Como este projeto foi criado somente para melhorar os conhecimentos nas tecnologias mais recentes e mais visadas do mercado, as informações que contem no site somente são ilustrativas com a finalidade de preenchimento de conteúdo.",
            "ExampleImageAlt": "Project Print",

            "finalTitle": "Triper atualmente",
            "finalDescription": "Atualmente neste projeto ocorrem eventuais atualizações, tanto de implementações que podem ficar melhor visualmente e esteticamente, como melhorias de código que são feitas para melhorar performance e navegação, sempre que essas atualizações ocorrem é feito revisões de como foi feito antes e como está atualmente e também faço a utilização dos códigos deste projeto como exemplo para aplicações e dúvidas do dia a dia.",

            "banner_description": "Saiba como aumentei meus conhecimentos nas tecnologias mais utilizadas no mercado atualmente."
        },

        "pet_system" : {
            "title": "",
            "fisrtDescription": "",

            "projectDate": "",
            "urlBanner": "",

            "problemTitle": "",
            "problemDescription": "",

            "solutionTitle": "",
            "solutionDescription": "",

            "ExampleTitle": "",
            "ExampleDescription": "",
            "ExampleImageAlt": "",

            "finalTitle": "",
            "finalDescription": ""
        }
    }
}