{
    "header_options": {
        "home": "Home",
        "projects": "Projects",
        "contact": "Contact",
        "button_design_option": "Design",
        "button_code_option": "Dev"
    },
    "all_projects": "All Projects",
    "cases": "Real Cases",
    "project": "Projects",
    "andWorks": "amd Works",
    "welcome_to_React": "Welcome to react-i18next",
    "title_banner": "Pedro Lopes",
    "overview_text_banner": "Hello! I'm pedro Lopes, designer and software developer, feel free to read more about me and my projects.",
    "first_section_title":"Who am I?",
    "first_modal_title":"Personal trajectory",
    "first_terminal_path_source":"personal",
    "first_terminal_description_0": " I start at tecnology through Quality and assurance job doing tests in financial products, after I implement maintenance in frontend of this products, in this moment i learn some javascript frameworks like vue.js, react, react-native and angular.",
    "first_terminal_description_1":"With the javascript knowledge, I start learning agil skills and improve my workflow and management of projects, next I studied backend programing languages and frameworks  like java with spring boot, Hibernate and javascript with node js, express, next js, loopback. Finally with this backend knowledge I studied some database functionalities with NOSQL and MYSQL.",
    
    "second_modal_title":"Professional experience",
    "second_terminal_path_source":"professional",
    "second_terminal_description_0":" Currently I work as full stack developer, I am in the way to graduate in software engineer at USC (University  of state Santa Catarina) I have 3 years of experience in frontend development  ans 2 years of experience in cakend development, I have done personal projects with javascript knowledge improving project and my software skills ",
    "second_terminal_description_1":"I have certificate in Graphic Design that helped me to improve my software skills and user interface (UI) and user experience (UX) having a diversified knowledge, now I still always learning design tools and software technologies with focus at user experience",

    "skills_modal_title":"Software Skills",

    "button_work_text_0":"Design projects",
    "button_work_text_1":"Web projects",
    "button_work_text_2":"Backend projects",

    "ux_project_description_0":"the UX/UI of these project was made from an exercise in process software class at university, the idea is help homeless animals that can be in danger...",
    "ux_project_description_1":"Match Coder is a UX/UI project was made from an exercise in process software class at university, the idea is to create a software that relate a job candidate and software companies...",
    "ux_project_description_2":"This UX/UI was created from a requirements list at project interface class on university, the idea is warn people from natural disasters that can be happening near user location...",
    "ux_project_description_3":"Educa Cred is a UX/UI project was made from a company challenge to proposal a financial solution for people that don't have much money based on requirements prototype...",
    
    "web_project_description_0":"Link Leito it's app that has functionalities to attend patients from a hospital, the idea is reduce hospitalization time and all health professionals can see the patient flow...",
    "web_project_description_1":"The chat app it's an aplication of chat messages, this project was made with vue js, node js and socket io to have a real time communication and the database is mongo db...",
    "web_project_description_2":"Quizz Game it's a question and answer game, the idea is create questions that focus in important tests in Brazil and all question count points, was created in javascript...",
    "web_project_description_3":"Pet System it's admin system developed for a pet shop managment, the system was created with pure HTML, CSS javascript without any framework... ",
    "web_project_description_4":"AdmitOne it's a project that recreating the home page of the web page https://admitone.com/ ,it was a frontend challenge to a frontend job interview...",

    "backend_project_description_0":"This Project was create with node js, mongodb, express js to make easy way built an API application to management data  and points from the players  of quizz game app, there is unit tests running on this app too...",
    "backend_project_description_1":"This API was created with node js, express framework, cloudinary for upload images, mongo db as data base and socket io for real time communication for chat messages work on the-chat-app, there is unit tests running on this app too...",
    "backend_project_description_2":"This API was created with node js express framework, cloudinary for upload images and nodemailer to send emails, the ideia, the ideia is to create a management images and emails, there is unit tests running on this app too...",
    "backend_project_description_3":"This API was created in java with spring boot, the idea of this app is to management data of link-leito app, sending, receiving and treating patient data having all hospital flow control...",

    "button_work_show_more":"show more",

    "footer_section_title":"Contact me",

    "footer_button_home":"back home",

    "modal_option_text":"Before entering this site, I want you to have the best experience possible, so tell me...",
    "button_design_option":"I'm just visiting",
    "button_code_option":"I'm from IT",

    "about_me_title": "About Me",
    
    "about_me_subtitle_1": "The Start",
    "about_me_text_1": "I start at tecnology through Quality and assurance job doing tests in financial products, after I implement maintenance in frontend of this products, in this moment i learn some javascript frameworks like vue.js, react, react-native and angular.",
    
    "about_me_subtitle_2": "Contact",
    "about_me_text_2": "You can contact me by email or social midia, I usualy answer in 3 days",
    
    "button_about_me_hire": "HIRE ME",
    "button_about_me_know_more": "KNOW MORE",

    "pretitle_services": "WHAT I WILL DO FOR YOU",
    "title_services": "Services",
    
    "services_ux_ui": "UX/UI",
    "services_ux_ui_text": "Create a project plan, wireframes, concept testing, style guide, responsiveness, User testing interface.",

    "services_web_dev": "Web Development",
    "services_web_dev_text": "Create a website and application based on a ux/ui project plan, responsiveness, multiplatform, and usability functionalities.",

    "services_software_engineer": "Software Engineering",
    "services_software_engineer_text": "Create an API application, CI/CD deployment, DevOps, and technology solution.",

    "comment_01": "Always helping colleagues with questions and willing to help their team.",
    "comment_02": "Pedro is an excellent professional and very easy to work with, many brilliant and relevant ideas.",
    "comment_03": "Always looking for improvement in their projects and constantly studying new methods and technologies to facilitate their applications.",
    "comment_04": "I recommend Pedro for any type of service in the technology area, an excellent professional.",

    "projects": {
        "electrolux" : {
            "title": "Software engineering at Electrolux",
            "fisrtDescription": "Electrolux has a 100-year history. During this time, it has achieved countless victories and accomplishments. The company has been active in Brasil since 1926 and sells millions of products per year. It is one of the only worldwide brands that […]",

            "projectDate": "20/12/2021",

            "problemTitle": "Electrolux",
            "problemDescription": "Electrolux has a 100-year history. During this time, it has achieved countless victories and accomplishments. The company has been active in Brasil since 1926 and sells millions of products per year. It is one of the only worldwide brands that offers quality products and effective solutions to both consumers and professionals. <br> <br> With a collection of innovative and carefully developed products, Electrolux has great prominence in the Brazilian kitchen appliances market. Thanks to this successful history, Electrolux Brasil is present in the homes and memories of many Brazilians. It has an A-team of professionals to continue this legacy of excellence with its clients, promoting the Electrolux experience to everyone that uses its products. <br> <br>",

            "solutionTitle": "Challenge",
            "solutionDescription": "One of the biggest stories that i had experienced as a software engineer is that my time Who attend Electrolux was an imigrattion of an old tecnology vtex (CMS) to a online storage more sofisticated and intuitive with an Headless VTEX IO technology, this imigration happened gradually, during this transition process, there was caution and analysis of conversions, for example, migrating only one or two pages to VTEX IO and observing the public's adherence to this new stack",

            "ExampleTitle": "Solution",
            "ExampleDescription": "Finally, we reached the end of the migration process and everything went well, the new face and body of electrolux brasil was in implemented and working for all customers, the ultimate goal of having a higher sales conversion was achieved, due to the new technology electrolux online store proved to be more and with a different experience than everyone else in the small appliances market.",
            "ExampleImageAlt": "Project Print",

            "finalTitle": "Electrolux nowadays",
            "finalDescription": "Electrolux continues to follow constantly improvements in all sectors of its store, i currently work as a software engineer for the Web Experience squad (User Experience) and have maintained constant improvements and adjustments that make the user have a professional and comfortable experience for customer's home, even if he is visiting the store or browsing the products.",
            
            "banner_description": "Understand the challenge of migrating one of the stores that sell the most small appliances in Brazil"
        },

        "link_leito" : {
            "title": "Projeto Link Leito",
            "fisrtDescription": "The Link-leito project was created in 2021 when the COVID-19 pandemic spread worldwide while I was studying at Florianopolis/SC Senai. At the beginning of the project, we relied [...]",

            "projectDate": "01/02/2020",

            "problemTitle": "Link Leito app",
            "problemDescription": "The Link-leito project was created in 2021 when the COVID-19 pandemic spread worldwide while I was studying at Florianopolis/SC Senai. At the beginning of the project, we relied on the collaboration of all the employees who worked in the hospital's emergency department, from the patient's admission to their discharge from the hospital, in constant validations with the team that would use the software that we were proposing to create. <br> <br> During the year 2021, with the pandemic already in place across the country, there were several difficult moments in carrying out face-to-face communication with the team due to social distancing measures, but even with the difficulties, we carried out the validations and consistently reduced the time of waiting for patient care and being able to observe points in the patient's hospitalization process and analyze where there were errors and excessive delays",

            "solutionTitle": "Implementation challenges",
            "solutionDescription": "Even though we understood the entire hospital process, one of the biggest challenges was to make that technology adhere to the hospital by the employees. We observed constant improvements throughout the implementation and validations, causing the project to grow exponentially.",

            "ExampleTitle": "The Link- leito Solution",
            "ExampleDescription": "The bed link proposed the definitive solution for queues in hospitals at a time when ICUs were overcrowded, based on the analysis of the care of several patients by capturing data during the process, such as the amount of time a patient takes to be seen or what it takes time for a bed to be clean and available again, using these time metrics, we built an administrative panel and reporting area so that the hospital manager could observe all the data and be able to adapt the team of professionals better.",
            "ExampleImageAlt": "link leito Project Print",

            "finalTitle": "Link- leito nowadays",
            "finalDescription": "Link- leito is temporarily deactivated because the hospital team decided to follow another path, and the difficulty in adhering to the software contributed to the shelved project. Still, it will never be forgotten, as there are several reports of Link- leito in the media. So that this project can move forward, many works and projects at the University I'm studying at the moment have some case study or explanation about the link.",

            "banner_description": "Know about the Link Leito project and the technological solution applied to reality."
        },

        "triper" : {
            "title": "Triper: Site de viagens",
            "fisrtDescription": "Triper é um website que criei recentemente com o objetivo de melhorar meus conhecimentos em Next.js, animações CSS e habilidades de código limpo. O site foi construído usando o framework Next.js […]",

            "projectDate": "20/12/2021",

            "problemTitle": "Caso de Estudo",
            "problemDescription": "Triper é um website que criei recentemente com o objetivo de melhorar meus conhecimentos em Next.js, animações CSS e habilidades de código limpo. O site foi construído usando o framework Next.js, que é uma ferramenta poderosa para criar front-end React com renderização do lado do servidor e geração de sites estáticos para aplicativos da web baseados em React. Foi muito interessante aprender essa ferramenta para entender como melhorar a performance de sites e melhorar a experiência do usuário em sua navegação. Durante o desenvolvimento fui também compreendendo diferentes opções de animações CSS para que o site ficasse mais fluido e sua navegação mais suavizada, animações de elementos da página e keyframes para criar movimentos personalizados.",

            "solutionTitle": "Soluções e aplicações",
            "solutionDescription": "Diante dos desafios da implementação, eu pude seguir as melhores práticas e padrões de organização de código e documentação para entender este cenário aplicado a um projeto em seguida comparar com aplicações do mercado atual. Em seguida pude compreender as diferentes lógicas que poderia aplicar nas animações da página e em quais momentos as animações aconteceriam, este processo exigiu implementar uma mistura do Next com o CSS e o resultado foi sensacional",

            "ExampleTitle": "O Projeto",
            "ExampleDescription": "Como este projeto foi criado somente para melhorar os conhecimentos nas tecnologias mais recentes e mais visadas do mercado, as informações que contem no site somente são ilustrativas com a finalidade de preenchimento de conteúdo.",
            "ExampleImageAlt": "Project Print",

            "finalTitle": "Triper atualmente",
            "finalDescription": "Atualmente neste projeto ocorrem eventuais atualizações, tanto de implementações que podem ficar melhor visualmente e esteticamente, como melhorias de código que são feitas para melhorar performance e navegação, sempre que essas atualizações ocorrem é feito revisões de como foi feito antes e como está atualmente e também faço a utilização dos códigos deste projeto como exemplo para aplicações e dúvidas do dia a dia.",

            "banner_description": "Saiba como aumentei meus conhecimentos nas tecnologias mais utilizadas no mercado atualmente."
        },
        
        "comunity_alert": {
            "title": "Comunity Alert UX/UI",
            "fisrtDescription": "O Community Alert foi uma proposta das aulas de projeto e interface da faculdade em que estou cursando, o intuito deste projeto foi criar um design ui/ux de um aplicativo que […]",

            "projectDate": "20/12/2021",

            "problemTitle": "Caso de Estudo",
            "problemDescription": "O Community Alert foi uma proposta das aulas de projeto e interface da faculdade em que estou cursando, o intuito deste projeto foi criar um design ui/ux de um aplicativo que pudesse alertar a comunidade de eventuais catástrofes ecológica, através de algumas reuniões e planejamentos foi feito uma lista para entender quais as necessidades que o aplicativo teria e qual seria o melhor design system para ser utilizado no desenho das telas",

            "solutionTitle": "Soluções e aplicações",
            "solutionDescription": "Através do entendimento de todas as necessidades do usuário principal foi realizado a produção de algumas telas pensando em aplicativos mobile, todas as telas foram exclusivamente pensadas para a resolução do problema em si. A forma como os componentes estão dispostos na tela e suas devidas posições e aparências até mesmo para causar diferentes impactos no usuário principal, a partir do entendimento sobre as “Regras de Ouro de Shneiderman” entendi alguns conceitos importantes para se aplicar em todas as telas do design",

            "ExampleTitle": "O Projeto",
            "ExampleDescription": "Este projeto foi feito somente no figma como telas UI com a finalidade de praticar boas práticas de design e entender os melhores caminhos para um bom ux, além de proporcionar um conhecimento em diferentes áreas que envolvem o dia a dia de um engenheiro de software em ambientes de alta performance, podendo passar pelo primeiro processo que é a confecção de novos produtos e nos estudos e análises que são feitas somente olhando para o design desses produtos.",
            "ExampleImageAlt": "Project Print",

            "finalTitle": "",
            "finalDescription": "",

            "banner_description": "Estudos e analises sobre projetos de design de interface."
        },

        "match_coder": {
            "title": "Match coder UX/UI",
            "fisrtDescription": "Match coder foi um projeto de design criado durante as aulas de engenharia de requisitos de software, o objetivo da criação desse design foi propor uma aplicação mobile que desenvolvedores de software e  […]",

            "projectDate": "20/12/2021",

            "problemTitle": "Caso de Estudo",
            "problemDescription": "Match coder foi um projeto de design criado durante as aulas de engenharia de requisitos de software, o objetivo da criação desse design foi propor uma aplicação mobile que desenvolvedores de software e empresas pudessem dar um match (assim como no tinder) para conhecer profissionais da TI e incentivar empregos para essa área. Através da análise de persona, eu e a equipe que atuou comigo neste trabalho, conhecemos os usuários que iriam utilizar o aplicativo e compreendi melhor quais componentes deveria utilizar e como ficariam nas telas do mobile.",

            "solutionTitle": "Soluções e aplicações",
            "solutionDescription": "Este projeto me proporcionou uma visão mais ampla sobre design, durante seu desenvolvimento pude aplicar diferentes conhecimentos de boas práticas aplicadas a protótipos, ensinamentos visuais e estéticos para que os elementos da tela fiquem mais claros e acessíveis para o usuário. Dessa maneira produzi diversas telas que traduzem a necessidade inicial, que foi das empresas encontrarem profissionais que tenham um perfil mais adequado para a vaga de emprego, assim como candidatos da área de T.I. que querem trabalhar em empresas com o seu perfil.",

            "ExampleTitle": "O Projeto",
            "ExampleDescription": "Este projeto foi feito somente no figma como telas UI com a finalidade de praticar boas práticas de design e entender os melhores caminhos para um bom ux, além de proporcionar um conhecimento em diferentes áreas que envolvem o dia a dia de um engenheiro de software em ambientes de alta performance, podendo passar pelo primeiro processo que é a confecção de novos produtos e nos estudos e análises que são feitas somente olhando para o design desses produtos.",
            "ExampleImageAlt": "Project Print",

            "finalTitle": "",
            "finalDescription": "",

            "banner_description": "Estudos e analises sobre projetos de design de interface."
        },

        "pet_care" : {
            "title": "Pet Care UX/UI",
            "fisrtDescription": "Pet care foi um projeto pensado em prototipagem de aplicativos, através das aulas de engenharia de requisitos da faculdade que estou cursando, eu e minha equipe tivemos o desafio de cria protótipos de telas para um sistema de gerenciamento para […]",

            "projectDate": "20/12/2021",

            "problemTitle": "Caso de Estudo",
            "problemDescription": "Pet care foi um projeto pensado em prototipagem de aplicativos, através das aulas de engenharia de requisitos da faculdade que estou cursando, eu e minha equipe tivemos o desafio de cria protótipos de telas para um sistema de gerenciamento para ONG’s voltadas ao acolhimento e proteção dos animais e através de reuniões de brainstorming e entendimento de quem seria os usuários do sistema, observamos quais as necessidades do usuário que utilizaria o sistema e pudemos perceber suas dores como um processo de alerta para animais abandonados, e um dos maiores desafios foi entender como realizar um processo de ampla divulgação desses alertas e fazer com que mais pessoas pudessem saber dos animais em situação de risco ou mesmo que foram resgatados e agora podem ser adotados a novas famílias.",

            "solutionTitle": "Soluções e aplicações",
            "solutionDescription": "Com o desenvolvimento das telas do sistema, alguns membros da equipe se concentraram na realização de documentos e eu me concentrei em traduzir todas as necessidades do usuário para telas do figma. Através de todos os requisitos levantados por membros da equipe, utilizei de diferentes técnicas de design como “projeção de diálogos que indiquem o fim de uma ação”, “fácil reversão de ações”, redução a carga de memória de curta duração” entre outras técnicas que foram utilizadas para seguir um design intuitivo e fluido, fazendo com a aplicação seja mais interessante para usuários navegar e realizar seus objetivos dentro do aplicativo.",

            "ExampleTitle": "O Projeto",
            "ExampleDescription": "Este projeto foi feito somente no figma como telas UI com a finalidade de praticar boas práticas de design e entender os melhores caminhos para um bom ux, além de proporcionar um conhecimento em diferentes áreas que envolvem o dia a dia de um engenheiro de software em ambientes de alta performance, podendo passar pelo primeiro processo que é a confecção de novos produtos e nos estudos e análises que são feitas somente olhando para o design desses produtos.",

            "finalTitle": "",
            "finalDescription": "",

            "ExampleImageAlt": "Project Print",

            "banner_description": "Estudos e analises sobre projetos de design de interface."
        },

        "the_chat" : {
            "title": "The chat",
            "fisrtDescription": "The chat foi um projeto criado para aprendizados em back and tendo um foco maior em lógicas aplicadas a comunicação em tempo real, A partir de algumas pesquisas estudos fui realizando […]",

            "projectDate": "20/12/2021",

            "problemTitle": "O projeto The chat",
            "problemDescription": "The chat foi um projeto criado para aprendizados em back and tendo um foco maior em lógicas aplicadas a comunicação em tempo real, A partir de algumas pesquisas estudos fui realizando diversas implementações para criar um sistema que fosse capaz de armazenar dados dos usuários e que estes pudessem se logar através de uma interface e acessarem suas mensagens, as lógicas que foram aplicadas pro sistema foram retiradas somente de exemplos visuais do telegram, whatsapp e outros aplicativos de conversa. O sistema é relativamente simples porém diversas tecnologias e métodos foram aplicados para criar um chat de comunicação em tempo real com dois usuários logados simultaneamente",

            "solutionTitle": "Desafios",
            "solutionDescription": "O maior desafio foi implantar a tecnologia socket.io que foi capaz de criar uma sessão onde dois usuários pudessem participar e trocar mensagens através dessa sessão, além deste método outro desafio foi utilizar o express como Framework pro Node Js para realizar upload de imagens e comunicação com o banco de dados de maneira a proteger as rotas do sistema em todos os momentos através de um token. Mesmo com esses desafios fui capaz de criar um sistema com rotas seguras e com comunicação constante com banco de dados e sessões do socket.io, pode também desenvolver front and onde os usuários pudessem se cadastrar, logar e interagir uns com os outros em tempo real",

            "ExampleTitle": "Intuito do projeto",
            "ExampleDescription": "Esta aplicação foi desenvolvida somente com o intuito de estudar novas ferramentas e tecnologias que o mercado de desenvolvimento já utiliza, e mesmo que tenha sido para estudo este projeto ainda tem atualizações frequentes tanto em seu front end quanto no seu backend pensando em melhorias para se fazer em diferentes níveis da aplicação protagonizando uma escala cada vez maior. Um dos planos mais recentes para este projeto é criar um website para apresentação do projeto e suas novidades para que novos usuários possam entrar e conhecer um pouco do the chat antes mesmo de precisar se cadastrar",

            "finalTitle": "",
            "finalDescription": "",

            "ExampleImageAlt": "Project Print",

            "banner_description": "Conheça sobre o aplicativo web desenvolvido para trocas de mensagens em tempo real."
        },

        "quest_game" : {
            "title": "Quest Game",
            "fisrtDescription": "O jogo quest app foi feito para as aulas de engenharia de software da faculdade que estou cursando atualmente, ele conta com um sistema de perguntas e respostas onde cada resposta[…]",

            "projectDate": "20/12/2021",

            "problemTitle": "O projeto The chat",
            "problemDescription": "O jogo quest app foi feito para as aulas de engenharia de software da faculdade que estou cursando atualmente, ele conta com um sistema de perguntas e respostas onde cada resposta certa que o usuário consegue pontos para melhor se encaixar no ranking, não é necessário possuir um cadastro prévio, somente com o nickname é possível já ter acesso ao sistema e começar a responder às diversas perguntas que existem.",

            "solutionTitle": "Desafios",
            "solutionDescription": "Um dos maiores desafios na construção desse projeto foi desenvolver um sistema onde cada resposta correta acumulasse uma determinada pontuação e pudesse dar essa pontuação para usuário, além de criar pontuações diferentes para perguntas de níveis diferentes portanto criei um sistema que quanto maior a dificuldade mais pontos o jogador ganharia caso respondesse a resposta certa. O frontend deste projeto foi criado em vue js e o backend foi feito utilizando node js com express.",

            "ExampleTitle": "Intuito do projeto",
            "ExampleDescription": "Conforme as informações que foram enviadas previamente a partir de um documento de requisitos para Construção do software criamos um modelo competitivo de perguntas e respostas no qual foi solicitado durante as aulas, atualmente o sistema continua em funcionamento e disponível de forma gratuita na internet.",

            "finalTitle": "",
            "finalDescription": "",

            "ExampleImageAlt": "Project Print",

            "banner_description": "Conheça sobre o jogo de perguntas e respostas web desenvolvido para universitários que querem prestar para provas do vestibular."
        },

        "blue_token" : {
            "title": "Desenvolvedor de software no BLUE",
            "fisrtDescription": "O jogo quest app foi feito para as aulas de engenharia de software da faculdade que estou cursando atualmente, ele conta com um sistema de perguntas e respostas onde cada resposta[…]",

            "projectDate": "20/12/2021",

            "problemTitle": "BLUE token.",
            "problemDescription": "O BLUE é um token digital que representa uma cesta de criptomoedas, que permite o acesso às melhores criptomoedas do mercado, o BLUE, assim como outros tokens digitais, foi criado numa blockchain com um conjunto específico de regras. O BLUE usa o Binance Smart Chain (BSC) blockchain e permite que seus usuários tenham várias criptomoedas ao mesmo tempo, mantendo apenas um token, proporcionando aos usuários conveniência e diversificação.",

            "solutionTitle": "Relatos da engenharia.",
            "solutionDescription": "Um dos maiores relatos que trago como engenheiro de software que participou da construção do token blue foi a criação de seu novo website, com o intuito de uma nova aparência para a marca o website tem o foco de mostrar algumas caracteristicas do token além de proporcionar uma visão ampla de todas as funcionalidades e beneficios que usuários terão ao adquirir BLUE’s",

            "ExampleTitle": "BLUE token atualmente",
            "ExampleDescription": "Atualmente a empresa continuar a manter o produto com uma das maiores performances do mercado de cripta moedas, um exemplo perfeito disso são atualizações de como o mercado está performance durante um trimestre, essas informações são coletadas pelos profissionais que atuam no BLUE e criam reports trimestrais sempre mantendo todos os usuários atualizados dos seus investimentos",

            "finalTitle": "",
            "finalDescription": "",

            "ExampleImageAlt": "Project Print",

            "banner_description": "Entenda como foi a reconstrução de um novo website para o token blue."
        },

        "toro_token" : {
            "title": "Desenvolvedor de software no TORO",
            "fisrtDescription": "TORO é o primeiro portfólio tokenizado desse tipo, programado para seguir estratégias ativas e passivas em benefício de seus detentores como STOP LOSS, STOP BUY, SHORTING e distribuições de rede, O objetivo de TORO é facilitar o processo da construção de […]",

            "projectDate": "20/12/2021",

            "problemTitle": "TORO token.",
            "problemDescription": "TORO é o primeiro portfólio tokenizado desse tipo, programado para seguir estratégias ativas e passivas em benefício de seus detentores como STOP LOSS, STOP BUY, SHORTING e distribuições de rede, O objetivo de TORO é facilitar o processo da construção de um portfólio de ativos digitais, buscando ativamente ganhos e mitigando perdas. Os detentores podem participar de um portfólio com recursos avançados de negociação integrados, mantendo um único token: o TORO token.",

            "solutionTitle": "Relatos da engenharia.",
            "solutionDescription": "Um dos maiores relatos que trago como engenheiro de software frontend que participou da construção do Toro token foi a criação de seu novo website, com o intuito de uma nova aparência para a marca o website tem o foco de mostrar algumas características do token além de proporcionar uma visão ampla de todas as funcionalidades e benefícios que usuários terão ao adquirir o Toro token.",

            "ExampleTitle": "TORO token atualmente",
            "ExampleDescription": "Atualmente o produto está sendo construído por uma equipe de profissionais em estratégias de negociações do mercado de ações e criptomoedas e durante o ano de 2023 promete diversas novidade e diferentes funcionalidades para os uruários que entrar na pré-venda",

            "finalTitle": "",
            "finalDescription": "",

            "ExampleImageAlt": "Project Print",

            "banner_description": "Entenda como foi a construção de um novo website para o TORO token."
        },

        "genesis_bank" : {
            "title": "Desenvolvedor mobile na genesis bank",
            "fisrtDescription": "Genesis bank é uma plataforma digital voltado para operações B2B, seu principal objetivo é conectar empresas ao mundo financeiro A adesão não está aberta para o público e somente com convite uma empresa pode operar com a genesis bank. O intuito da plataforma é […]",

            "projectDate": "20/12/2021",

            "problemTitle": "Genesis Bank.",
            "problemDescription": "Genesis bank é uma plataforma digital voltada para operações B2B, seu principal objetivo é conectar empresas ao mundo financeiro. A adesão não está aberta para o público e somente com convite uma empresa pode operar com a genesis bank. O intuito da plataforma é ajudar empresários a se formalizarem dando suporte a todo o processo de abertura de empresa, auxílio com a contabilidade, pagamento de impostos, aconselhamento jurídico e a se bancarizarem.",

            "solutionTitle": "Relatos da engenharia.",
            "solutionDescription": "Um dos maiores relatos que trago como engenheiro de software frontend que participou do projeto da genesis bank foi a reconstrução de seu aplicativo mobile, a partir de um design proposto pelo time de UX/UI comecei a construção das páginas iniciais como, login, cadastro e dashboard, passando até pelo momento de pagamento dentro do aplicativo, a nova interface permitiu mais acessibilidade e uma melhores simetrias visuais para que os usuários se sentissem bem ao utilizar a ferramenta.",

            "ExampleTitle": "Genesis Bank atualmente",
            "ExampleDescription": "Atualmente o produto está sendo constantemente atualizado e mantido por uma equipe de desenvolvimento e profissionais em estratégias de negociações com empresários do ramo.",

            "finalTitle": "",
            "finalDescription": "",

            "ExampleImageAlt": "Project Print",

            "banner_description": "Entenda como foi a reconstrução de um aplicativo mobile para uma startup de tecnologia bancárias."
        },

        "pet_system" : {
            "title": "PetSystem",
            "fisrtDescription": "PetSystem é o meu primeiro projeto desenvolvido para aprender conceitos de programação html e CSS, o projeto conta com tecnologias utilizadas na web sem a utilização de frameworks, quando este projeto foi feito […]",

            "projectDate": "20/12/2021",

            "problemTitle": "PetSystem.",
            "problemDescription": "PetSystem é o meu primeiro projeto desenvolvido para aprender conceitos de programação html e CSS, o projeto conta com tecnologias utilizadas na web sem a utilização de frameworks, quando este projeto foi feito eu ainda estava estudando as tecnologias do mercado e entendendo como o mundo de desenvolvimento funcionava, por tanto não utilizei frameworks de mercado mais atuais mas me concentrei nos ensinamentos básicos sobre programação e estilização.",

            "solutionTitle": "Relatos da engenharia.",
            "solutionDescription": "Basicamente este projeto tem o intuito de gerar um sistema ERP para pet shop onde é possível o dono do pet shop realizar cadastro de produtos suas compras vendas e outras funcionalidades que permite o controle de um pet shop. Todas as informações que são cadastradas dentro do sistema somente ficam disponíveis no navegador, este projeto não possui um banco de dados por trás fazendo com que as informações que são cadastradas no sistema fiquem somente durante determinado período e depois são excluídas.",

            "ExampleTitle": "PetSystem atualmente",
            "ExampleDescription": "Atualmente este projeto não possui uma continuação ou mesmo atualizações devido a grande complexidade do que foi implementado, porém este projeto ainda serve de muita consulta de boas práticas de código ou mesmo de funcionalidades que foram implementadas e podem ser reutilizadas em projetos do dia a dia.",

            "finalTitle": "",
            "finalDescription": "",

            "ExampleImageAlt": "Project Print",

            "banner_description": "Conheça mais do primeiro projeto que fiz para aprender sobre programação web."
        }
    },

    "know_more_about_project": "learn more about this project"
}